import os
import random

import telebot

bot = telebot.TeleBot('864379599:AAEMSsCLOfrVwqnWkNR14zOTh1oDYgCunKs')

smiles = [
'💋',
'❤',
'😀',
'😃',
'😄',
'😁',
'😆',
'😅',
'😂',
'🤣',
'😊',
'😇',
'🙂',
'🙃',
'😉',
'😌',
'🥰',
'😘',
'😗',
'😙',
'😚',
'😋',
'😛',
'😝',
'😜',
'🤪',
'🤨',
'😎',
'🤩',
'🥳',
'😞',
'😔',
'😢',
'🥺',
'😭',
'😩',
'😫',
'😭',
'😢',
'😡',
'🤥',
'🤫',
'😬',
'🤔',
'🤗',
'😪,'
'🤡',
'👻',
'😻',
'😼',
'😽',
'🙀',
'😿',
'😺',
'😸',
'😹',
'👅',
'Кохаю тебе',
'Люблю тебе',
'Обіймаю тебе',
'Цілую в щічку',
'Цілую в губи',
'Цілую в носик',
'Моя пташечка',
'Моє сонечко',
'Зайка',
'Бусічка',
'Найдороша',
'Мілашка',
'Веселушка',
'Вреднушка',
'Вредна мала',
'Ваня просив передати що дуже сильно тебе любить',
'Напиши до Вані , він скучає за тобою',
'Ваня не може без тебе',
'Є людина яка тебе любить',
'Кохана',
'Кнопочка',
'Серцеїдка',
]


@bot.message_handler(commands=['start'])
def send_welcome(message):
	bot.send_message(message.chat.id,"Привіт! Я смайлик-бот\nВ тебе поганий настрій , або ти відчуваєш самотність!\nНадішли мені смайлик і я відповім також смайликом!")

@bot.message_handler(func=lambda message: True)
def send_smiles(message):
	bot.send_message(message.chat.id,random.choice(smiles))

bot.polling()


